-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        8.0.13 - MySQL Community Server - GPL
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  9.5.0.5196
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 테이블 visualization.export 구조 내보내기
CREATE TABLE IF NOT EXISTS `export` (
  `date` year(4) DEFAULT NULL,
  `place` varchar(50) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `name` varchar(50) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `value` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- 테이블 데이터 visualization.export:~50 rows (대략적) 내보내기
DELETE FROM `export`;
/*!40000 ALTER TABLE `export` DISABLE KEYS */;
INSERT INTO `export` (`date`, `place`, `name`, `value`) VALUES
	('2013', '1위', '반도체', 57143),
	('2013', '2위', '석유제품', 52787),
	('2013', '3위', '자동차', 48635),
	('2013', '4위', '선박해양구조물및부품', 37168),
	('2013', '5위', '평판디스플레이및센서', 28613),
	('2013', '6위', '무선통신기기', 27578),
	('2013', '7위', '자동차부품', 26079),
	('2013', '8위', '합성수지', 21369),
	('2013', '9위', '철강판', 17494),
	('2013', '10위', '전자응용기기', 10896),
	('2014', '1위', '반도체', 62426),
	('2014', '2위', '석유제품', 50784),
	('2014', '3위', '자동차', 48924),
	('2014', '4위', '선박해양구조물 및 부품', 39886),
	('2014', '5위', '무선통신기기', 29573),
	('2014', '6위', '자동차부품', 26635),
	('2014', '7위', '평판디스플레이 및 센서', 26498),
	('2014', '8위', '합성수지', 21691),
	('2014', '9위', '철강판', 19144),
	('2014', '10위', '전자응용기기', 9800),
	('2015', '1위', '반도체', 62717),
	('2015', '2위', '자동차', 45794),
	('2015', '3위', '선박해양구조물 및 부품', 40107),
	('2015', '4위', '무선통신기기', 32587),
	('2015', '5위', '석유제품', 32002),
	('2015', '6위', '자동차부품', 25550),
	('2015', '7위', '평판디스플레이 및 센서', 21915),
	('2015', '8위', '합성수지', 18418),
	('2015', '9위', '철강판', 16458),
	('2015', '10위', '전자응용기기', 10038),
	('2016', '1위', '반도체', 62005),
	('2016', '2위', '자동차', 40637),
	('2016', '3위', '선박해양구조물 및 부품', 34268),
	('2016', '4위', '무선통신기기', 29664),
	('2016', '5위', '석유제품', 26472),
	('2016', '6위', '자동차부품', 24415),
	('2016', '7위', '합성수지', 17484),
	('2016', '8위', '평판디스플레이및센서', 16582),
	('2016', '9위', '철강판', 15379),
	('2016', '10위', '플라스틱제품', 9606),
	('2017', '1위', '반도체', 97937),
	('2017', '2위', '선박해양구조물 및 부품', 42182),
	('2017', '3위', '자동차', 41690),
	('2017', '4위', '석유제품', 35037),
	('2017', '5위', '평판디스플레이 및 센서', 27543),
	('2017', '6위', '자동차부품', 23134),
	('2017', '7위', '무선통신기기', 22099),
	('2017', '8위', '합성수지', 20436),
	('2017', '9위', '철강판', 18111),
	('2017', '10위', '컴퓨터', 9177);
/*!40000 ALTER TABLE `export` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
